'use strict';

//////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////
/* //////////////////////// Завдання №1

let money = prompt("Ваш бюджет на месяц?", ''),
    time = prompt("Введите дату в формате YYYY-MM-DD", '');

let appData = {
    budget: money,
    timeData: time,
	expenses: {},
	optionalExpenses: {},
	income: [],
	savings: false
};

let q1 = prompt("Введите обязательную статью расходов в этом месяце", ''),
    q2 = prompt("Во сколько обойдется?", ''),
    q3 = prompt("Введите обязательную статью расходов в этом месяце", ''),
    q4 = prompt("Во сколько обойдется?", '');

appData.expenses[q1] = q2;
appData.expenses[q3] = q4;

alert(appData.budget/30);
*/

////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////// Завдання №2 

let money = +prompt("Ваш бюджет на месяц?", ''),
    time = prompt("Введите дату в формате YYYY-MM-DD", '');

let appData = {
    budget: money,
    timeData: time,
	expenses: {},
	optionalExpenses: {},
	income: [],
	savings: false
};
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 ///////////////////////////// => For Варіант №1
 /*
for (let i = 0; i < 2; i++) {
    let a = prompt("Введите обязательную статью расходов в этом месяце", ''),
        b = prompt("Во сколько обойдется?", '');

    if ( (typeof(a)) === 'string' && (typeof(a)) != null && (typeof(b)) != null // ( (typeof(a)) === 'string' ) - 
        // && (typeof(a)) != null => не ровно пустому незаповненному полю (щоб не залишали незаповненні поля в формі)
        && a != '' && b != '' // && a!= '' - і а не повинна бути пустою сторкою => && b != '' - те саме
        && a.length < 50 ) {  // && a.length <50 - обмежує кількість символів в полі
            console.log('done');
            appData.expenses[a] = b;
    } else {
        console.log ('Wrong');
            i--;             // прописати повернення на крок назад якщо всы умови вище не спрацювали
    }
};
*/

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/* ///////////////////////// => While Варіани №2

let i = 0;
while (i < 2) {
    let a = prompt("Введите обязательную статью расходов в этом месяце", ''),
        b = prompt("Во сколько обойдется?", '');

        if ( (typeof(a)) === 'string' && (typeof(a)) != null && (typeof(b)) != null && a != '' && b != '' && a.length < 50 ) {
        
        appData.expenses[a] = b;

    } else {
        console.log ('Wrong');
            i--; 
    }
    i++;
};
*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////// => While Варіани №3

let i = 0;
do {
    let a = prompt("Введите обязательную статью расходов в этом месяце", ''),
        b = prompt("Во сколько обойдется?", '');

        if ( (typeof(a)) === 'string' && (typeof(a)) != null && (typeof(b)) != null && a != '' && b != '' && a.length < 50 ) {

        console.log ("Done");
        
        appData.expenses[a] = b;
    } else {
        console.log ('Wrong');
            i--; 
    }
    i++;
}
while (i < 2);


appData.moneyPerDay = appData.budget / 30;

alert ("Бюджет на 1 день: " + appData.moneyPerDay + "грн.");

if (appData.moneyPerDay < 100) {
    console.log ("Минимальный уровень достатка!");
} else if (appData.moneyPerDay > 100 && appData.moneyPerDay < 2000) {
    console.log ("Средний уровень достатка!");
} else if (appData.moneyPerDay > 2000) {
    console.log ("Высокий уровень достатка!");
} else {
    console.log ("Произошла ошибка");
}