'use strict';

/* //////////////////// 

//=> while Способ №1

let num = 50;           // Перемінна
while (num < 55) {      // Початок цикла Поки nam не буде <55 цикл буде виконуватись
    console.log(num);   // Кожен раз при виконанні циклу виводит результат в консоль
    num++;              // Післі кожного циклу до num добавляти +1
}
*/

/* /////////////////////
//=> do Якщо потрібно щось виконати а потім перевірити
let num = 50;
do {                    // Cделай чтото
    console.log(num);   // Кожен раз при виконанні циклу виводит результат в консоль
    num++;              // Післі кожного циклу до num добавляти +1
}
while (num < 55);       // Перевірка цеклу. Якщо він виконається до 55 то фініш
*/


// Найбільш використовуємий цикл є for
/* ///////////////////////
for (let i = 1; i < 8; i++) {    // В круглих душках записуємо умови (тут три аргументи) і - скорочене від індекс.  
// 1 - аргумент початок цикла. 
//2 - умова при якому цикл припинить роботу. 
//3 - що буде відбуватись кожний раз в новому циклі.
    console.log(i);
}
*/


//////////////////////////
/*
for (let i = 1; i < 8; i++) {
    if (i == 6) {              // Щоб зупинити цикл на певній умові потрібно прописати if i break; 
        break;
    }    
    console.log(i);
}
*/

/////////////////////////////
for (let i = 1; i < 8; i++) {
    if (i == 6) {               // Пропустити одну ітерацію цикла 6 використовуєио соманду "continue"
        continue;
    }    
    console.log(i);
}
