'use strict';
/*
let obj = new Object()      //Метод №1 для создания обєкта (редко используется)
*/
 let options = {      // Створення обєкта з допомогою фігурних душок
    widht: 1024,    // Обєкт завжди містьть (Ключ : Значення) (Банан : Фрукт) - це є свойства обєкта
    height: 1024,
    name: "test"
};

console.log(options.name);  // виводимо суто значення name в консоль */
options.bool = false; // так можна дописувати свойства конкректного обєкта поза ним
options.colors = {  // Можна в обєкт помістити ще інший обєкт 
    border: "black",
    bg: "red"
};

delete options.bool;  //Можна удалити свойства з обєкта

console.log(options);

//цикл для перечисления всех свойств в обэкте

for (let key in options) {  //перемінна що означає кожне свойство або метод в оюєкті (let key)
                            //потім прописуєм оператор "in" і назву обєкта "options" 
    console.log('Свойства ' + key + ' имеет значение ' + options[key]);
// + key + кожне ствойство яке є в перемінній
// + options[key] отримати свойство тек само як було вище let(options.name)
}
// кількість свойств в обєкті
console.log(Object.keys(options).length);  //Object - з яким обєктом ми будемо працювати
                    // .keys робота з ключами (свойствами) обєкта
                    // (options) - обєкт який передати
                    // .length - кількість наших свойств в обєкті




